[
  {
    "id": "dd073c3a-53b7-11e8-9cb7-fd8c4489f436",
    "created_at": "Wed May 09 18:36:18 UTC 2018",
    "title": "Siri - UI Web Developer",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Are you looking for an exciting opportunity to work on a dynamic development tools team passionate about delivering software tools that support the most exciting virtual assistant in the world? Do you love the challenge of solving complex problems that can have a direct impact on the success of the company? Siri Design Tools Team is looking for a highly motivated, energetic, and experienced UI developer with background in crafting flexible, usable and scalable UI/UX experiences. You'll enjoy working collaboratively with our engineering partners to design and improve our software and hardware testing infrastructure. Be a part of a diverse team of engineers using creativity and flexibility to design software that our engineers love to use. You can help inspire change, by using your skills to influence the future of our tools. You'll be challenged to make it go faster, be more reliable, and intuitive. Do you like working on a team that makes a difference with the products they create? We are an equal opportunity team with many opportunities for growth and experience. You will get to work with the latest software technologies as we refactor, extend, and enhance our current software stack. You'll work along side engineering/Design/QA to understand problems and delivery extraordinary solutions to our customers.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>8+ years of experience</li>\n<li>Some combination of the following skills would help you be successful at this job: Expert knowledge of JavaScript: must know closures, self-executing anonymous functions (aka IIFE), using the module pattern to create private variables, prototypical inheritance, promises, and scope</li>\n<li>Strong knowledge of HTML5 and CSS3 transforms and transitions Experience with a JS framework: React or Angular</li>\n<li>Experience with some JS utility libraries: Lodash, moment, jQuery, Bootstrap Experience with a JS templating library: Mustache, Handlebars, Dust Experience with source control (preferably git)</li>\n<li>A passion for the simple over the complex</li>\n<li>Knowledge of Redux, RxJS, Node.js, Mocha, Chai, Grunt, Gulp, and/or Webpack are a plus</li>\n</ul><p>Description:<br>\nIf you're passionate about building best in class web applications, we may have the job for you. The Siri Design Tools team is looking for someone who gets excited about building UI’s that are intuitive, easy to use, and present complicated data in simple, easy to understand ways. As a UI Engineer, you will work with a team of highly experienced people to build and maintain a suite of analytical web applications that chart, map, analyze, and diagnose our technologies.</p>\n\n<p> </p>\n\n<p>Education:<br>\nBachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience required. Masters Degree desired.</p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 113490606\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p><a>Apply here</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/da94deb2-53b7-11e8-89bc-f7b6569daf3c.jpeg",
    "url": "http://jobs.github.com/positions/dd073c3a-53b7-11e8-9cb7-fd8c4489f436"
  },
  {
    "id": "34c2b25e-52ed-11e8-8823-b70fc68771e5",
    "created_at": "Tue May 08 18:26:29 UTC 2018",
    "title": "Senior Full Stack Engineer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<p>Womply is leveling the playing field for American small businesses with proprietary data and next-generation SaaS that helps small business owners get more customers, keep them coming back, and save time every day. We’re one of the fastest growing software companies in the country, serving over 100,000 small business merchants across 400+ business verticals in every corner of America.</p>\n\n<p>As a Full Stack Engineer, you will be responsible for building applications that help small business owners thrive in a digital world. You will be responsible for creating applications that help merchants monitor their business, boost their reputation and engage their customers. Working in an agile, cross-functional team, you’ll deliver SaaS products that immediately drive business value through data-driven decision making. You will be working with Product and Design teams to define applications that Small Business Owners can’t live without. You will work with other engineers to assemble product value based on rich core datasets. You will also work with data science to build self-driving applications that do the work for our user.</p>\n\n<p>Requirements:</p>\n\n<p>7+ years overall development experience.\nExperienced in Web application development, able to work on both front-end and back-end portions of an application\nStrong understanding of semantic HTML, responsive CSS\nExtensive experience with Javascript fundamentals and frameworks such as AngularJS or React\nExperience developing Ruby applications\nExperience with web application frameworks such as Rails, Express, Django\nKnowledge and experience with Java, a plus\nVersed in SQL with an understanding of data stores like Redis\nKnows how to build RESTful APIs\nCan architect solutions based on AWS, Microservices, and Docker\nLeverages continuous integration to ensure streamlined deploys that are high quality\nCome build something amazing at Womply</p>\n\n<p>We’re a fanatically values-based company with $50 million raised to accelerate our growth. We work hard and push each other to be the best, but we also have fun and don’t take ourselves too seriously. If you want to win and make a big impact, let’s talk. We’re hiring in San Francisco, Portland, and Lehi, Utah for engineering, DevOps, design, data science, sales, marketing, business development, account management, and more.</p>",
    "how_to_apply": "<p>apply online or email <a href=\"mailto:ccastillo@womply.com\">ccastillo@womply.com</a></p>\n\n<p><a href=\"https://www.womply.com/jobs/san-francisco/?gh_jid=1112975\">https://www.womply.com/jobs/san-francisco/?gh_jid=1112975</a></p>",
    "company": "Womply",
    "company_url": "https://www.womply.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/911a7b8c-52ec-11e8-8717-98757eeae27f.png",
    "url": "http://jobs.github.com/positions/34c2b25e-52ed-11e8-8823-b70fc68771e5"
  },
  {
    "id": "f5586c9a-5228-11e8-9fc5-af2aed93d1d9",
    "created_at": "Mon May 07 19:01:10 UTC 2018",
    "title": "Software Engineer, Service Reliability",
    "location": "Stanford, CA",
    "type": "Full Time",
    "description": "<p>Software Engineer, Service Reliability</p>\n\n<p>Stanford University</p>\n\n<p>Job Number: 78806</p>\n\n<p>Job Code: 4823\nGrade: L\nExemption: Exempt\nSchedule: Full-time</p>\n\n<p>Are you an individual ready to make an impact leveraging your programming skills to change the world? Do you have experience scripting, integrating disparate systems, and developing tools? Do you say no to the status quo? Are you looking to join and exciting team that has over 150 years' experience developing and supporting applications for Stanford University?As a Service Reliability Engineer, you will need to be curious and possess deep technical knowledge. You will need to engage and build deep expertise with Stanford data and tools; apply high standards to the code around you and develop an ability to identify highly impactful projects in a complex domain. You will be responsible for building, maintaining and enhancing the internal systems and tools that the Stanford Communications Services operations teams rely on to help resolve issues for our community and partners. Those who join this team are incredibly passionate about their work and thrive working with cross-functional teams so that they can improve their operational efficiency through the development of tools and automation. This is your chance to join the team that helps build intelligent and efficient tooling to ensure that people who use and rely on Stanford Communication Services have the best possible experiences.We are looking for passion, attention to detail, taking pride in one's work, taking ownership, and having ideas/opinions. Above all, you will need to be able to work independently: asking questions to understand the requirements, estimating the level of effort for your development, and managing to a timeline. You're a problem solver and someone who uses ingenuity to solve hard problems. If you're an enthusiastic team player who cares about the infrastructure, remains calm in crisis, collaborates cross functionally, and loves writing code to improve operations we want to talk to you.You'll be a part of a modern, lean, self-governing engineering team. We value transparency and trust. We continue to create purpose in our work, seek individual mastery and encourage autonomy.So… <a href=\"https://uit.stanford.edu/organization/automation-service-reliability\">https://uit.stanford.edu/organization/automation-service-reliability</a>? At the end of the day, our organization's mission is to deliver world-class service and technological solutions in support of research, teaching and learning, administration, and healthcare at Stanford. Our team gets pulled into projects requiring custom development of any kind. This development typically involves quickly learning 3rd party APIs, developing automation critical to the implementation or maintenance of an application or service, automating tasks in support of reliability, or developing tools where no software solution exists on the commercial market. The Service Reliability Engineer is a member of the Automation and Service Reliability team in the Communication Services division of IT Services. We are part of University IT (UIT), the central IT organization for Stanford University. This position will report directly to the Director of Automation and Service Reliability.\nCORE DUTIES:</p>\n\n<ul>\n<li>Work independently including asking questions to understand the requirements, estimating the level of effort for your development, and managing development to a timeline.</li>\n<li>Learn quickly and apply knowledge to ones work to deliver solutions quickly.</li>\n<li>Lead projects, as necessary, for special systems and application development in areas of complex problems.</li>\n<li>Design and develop features in both the cloud and on premise that enable radically simplified automation.</li>\n<li>Innovate new tools that allow our organization to deliver our services more quickly: self service provisioning, deprovisioning and management of services at scale.</li>\n<li>Improve scalability, service reliability, capacity, and performance.</li>\n<li>Propose, conceptualize, design, implement, and develop solutions for difficult and complex applications independently.</li>\n<li>Leverage third party APIs to build integrations with other systems.</li>\n<li>Possess expert programming and troubleshooting skills in order to resolve highly complex problems where the analysis and resolution requires extensive knowledge of the many diverse system components, such as: authentication, networking, firewalls, databases, operating systems, storage, and server hardware.</li>\n<li>Participate in meetings with senior level staff and possess professional services level soft skills.</li>\n<li>Oversee testing, debugging, change control, and documentation for projects.</li>\n<li>Improve the physical design of existing systems to optimize performance.</li>\n</ul><p>MINIMUM REQUIREMENTS:</p>\n\n<p>Education &amp; Experience:\nBachelor's degree and eight years of relevant experience, or a combination of education and relevant experience.\nKnowledge, Skills and Abilities:</p>\n\n<ul>\n<li>Domain experience with building solutions or applications on premise or in the cloud.</li>\n<li>Experience with building web services using REST.</li>\n<li>Proficient understanding of code versioning tools, such as Git.</li>\n<li>Experience with continuous integration.</li>\n<li>Demonstrated experience leading activities on structured team development projects.</li>\n<li>Ability to learn quickly and adapt to new technologies and programming tools.</li>\n<li>Able to understand and often predict the emergent behavior of complex systems.</li>\n<li>Demonstrated experience in designing, developing, testing, and deploying applications.</li>\n<li>Demonstrated experience leveraging third party APIs to build integrations.</li>\n<li>Demonstrated experience with application technologies such as servlet, JSP, JSTL, XHTML, XSLT, PHP, CSS, Javascript, Perl, Flash, jQuery, and JSON and AJAX. Python experience required.</li>\n<li>Strong understanding of data design, architecture, relational databases, and data modeling.</li>\n<li>Must have extensive understanding of networking protocols (TCP/IP, HTTP, SSL, DNS, FTP, etc) and extensive knowledge of complex firewall topologies.</li>\n<li>Must have extensive experience in Web Services (REST, SOAP), XML and data persistence layer framework design and development.</li>\n<li>Thorough understanding of all aspects of software development life cycle and quality control practices.</li>\n<li>Must have a deep understanding and good working experience in application servers like Apache, Tomcat etc.</li>\n<li>Bonus points if you have experience with telephony APIs: Avaya API, Cisco Call Manager API, Level 3 API.</li>\n<li>Strong communication skills with both technical and non-technical clients.</li>\n</ul><p>Certifications and Licenses:None\nPHYSICAL REQUIREMENTS*:</p>\n\n<ul>\n<li>Constantly perform desk-based computer tasks.</li>\n<li>Frequently sit, grasp lightly/fine manipulation.</li>\n<li>Occasionally stand/walk, writing by hand.</li>\n<li>Rarely use a telephone, lift/carry/push/pull objects that weigh up to 10 pounds.</li>\n</ul><p>WORKING CONDITIONS:</p>\n\n<ul>\n<li>May work extended hours, evening and weekends.</li>\n</ul><p>WORK STANDARDS:</p>\n\n<ul>\n<li>Interpersonal Skills: Demonstrates the ability to work well with Stanford colleagues and clients and with external organizations.</li>\n<li>Promote Culture of Safety: Demonstrates commitment to personal responsibility and value for safety; communicates safety concerns; uses and promotes safe behaviors based on training and lessons learned.</li>\n<li>Subject to and expected to comply with all applicable University policies and procedures, including but not limited to the personnel policies and other policies found in the University's Administrative Guide, <a href=\"http://adminguide.stanford.edu\">http://adminguide.stanford.edu</a>.</li>\n</ul><p>Stanford is an equal opportunity employer and all qualified applicants will receive consideration without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other characteristic protected by law.</p>\n\n<p>*-Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of the job.</p>\n\n<p>Location: Business Affairs, California, United States</p>\n\n<p>To be considered for this position please visit our web site and apply on line at the following link: <a href=\"http://apptrkr.com/1217728\">http://apptrkr.com/1217728</a></p>\n\n<p>Stanford is an equal opportunity employer and all qualified applicants will receive consideration without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other characteristic protected by law.</p>\n\n<p>Copyright ©2017 Jobelephant.com Inc. All rights reserved.</p>\n\n<p><a href=\"https://www.jobelephant.com/\">https://www.jobelephant.com/</a></p>\n\n<p>jeid-bac9b2f354a26d4bab5bbadc84005547</p>",
    "how_to_apply": "<p>To be considered for this position please visit our web site and apply on line at the following link: <a href=\"http://apptrkr.com/1217728\">http://apptrkr.com/1217728</a></p>",
    "company": "Stanford University",
    "company_url": "http://www.stanford.edu",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e9f42e20-5228-11e8-9355-0b240df4b94b.png",
    "url": "http://jobs.github.com/positions/f5586c9a-5228-11e8-9fc5-af2aed93d1d9"
  },
  {
    "id": "01d286c4-5222-11e8-8522-875e5b9b32ed",
    "created_at": "Mon May 07 18:11:33 UTC 2018",
    "title": "Mobile Application Developer",
    "location": "Stanford, CA",
    "type": "Full Time",
    "description": "<p>Mobile Application Developer</p>\n\n<p>Stanford University</p>\n\n<p>Job Number: 77801</p>\n\n<p>The Stanford University Graduate School of Education (GSE) is a top ranked school of education, known for its prestigious faculty, rigorous graduate degree programs, and its impact on the quality of education across the world. The GSE is committed to developing leaders in education research, practice and policy. Our community includes over 60 Faculty, 400 students, 200 staff, 8,000 alumni and countless people from the local and global communities we work with and impact. The work environment is dynamic, deadline-driven, fast-paced, and energetic.</p>\n\n<p>As a part of GSE IT team, the Mobile Application Developer is responsible for supporting the GSE faculty's academic research projects by analyzing, designing, developing, implementing, modifying, and maintaining applications for iOS and Android devices. The Mobile Application Developer will utilize innovative programming and analytical skills.</p>\n\n<p>CORE DUTIES:</p>\n\n<ul>\n<li>Conceptualize design, implement, and develop complex applications for iOS and Android.</li>\n<li>Provide technical guidance in developing and implementing innovative software from concept to delivery in support of educational research and teaching.</li>\n<li>Translate software/program requirements into workable programming specifications and code.</li>\n<li>Work with designers to develop features that enable rich user experience.</li>\n<li>Troubleshoot and resolve user experience problems encountered during implementation and operation phases.</li>\n<li>Address client feature requests through entire software development life-cycle.</li>\n<li>Document system builds and application configurations; maintain and update documentation as needed.</li>\n<li>Develop and utilize data visualization tools to help researchers collect and display data.</li>\n<li>Use distributed version control management practices.</li>\n<li>Other duties, as assigned.</li>\n</ul><p>MINIMUM REQUIREMENTS:</p>\n\n<p>Education &amp; Experience:\nBachelor's degree and five years of relevant experience, or a combination of education and relevant experience.\nQualifications:</p>\n\n<ul>\n<li>5+ years of mobile application development experience for iOS and Android devices.</li>\n<li>Expertise in designing, developing, testing, deploying, and maintaining mobile applications for iOS and Android with strong understanding of the full mobile development life cycle.</li>\n<li>Experience with test tools such as Xcode, Eclipse, Android Studio and programming languages such as Swift, Objective C or Android Java.</li>\n<li>Experience with generating test versions via TestFlight. Publishing mobile apps at the App Store is preferred.</li>\n<li>Experience with C, C++, Java, Python, and Javascript.</li>\n<li>Knowledge of profile provisioning and key management.</li>\n<li>Knowledge of version control such as git.</li>\n<li>Ability to design and manage database (knowledge of Firebase is preferred).</li>\n<li>Experience with developing educational mobile applications is preferred.</li>\n<li>Knowledge of popular frameworks such as Cocoa-pods for iOS.</li>\n<li>Strong time management and project management skills.</li>\n<li>Excellent written communication skills.</li>\n<li>Strong communication skills with both technical and non-technical clients</li>\n<li>Proven ability to work in a team environment.</li>\n</ul><p>Certifications and Licenses:None</p>\n\n<p>PHYSICAL REQUIREMENTS:</p>\n\n<ul>\n<li>Constantly perform desk-based computer tasks.</li>\n<li>Frequently sit, grasp lightly/fine manipulation.</li>\n<li>Occasionally stand/walk, writing by hand.</li>\n<li>Rarely use a telephone, lift/carry/push/pull objects that weigh up to 10 pounds.</li>\n</ul><p>WORKING CONDITIONS:</p>\n\n<ul>\n<li>May work extended hours, evening and weekends.</li>\n</ul><p>WORK STANDARDS:</p>\n\n<ul>\n<li>Interpersonal Skills: Demonstrates the ability to work well with Stanford colleagues and clients and with external organizations.</li>\n<li>Promote Culture of Safety: Demonstrates commitment to personal responsibility and value for safety; communicates safety concerns; uses and promotes safe behaviors based on training and lessons learned.</li>\n<li>Subject to and expected to comply with all applicable University policies and procedures, including but not limited to the personnel policies and other policies found in the University's Administrative Guide, <a href=\"http://adminguide.stanford.edu\">http://adminguide.stanford.edu</a>\n</li>\n<li><p>Candidates should submit a cover letter (outlining why this position is of interest and they feel they're qualified) and a resume, along with the online application.</p></li>\n<li><p>Successful candidates will be required to complete a background check prior to working at Stanford University.</p></li>\n<li><p>Visa sponsorship is not available for this position; all candidates must be eligible to work in the US.</p></li>\n</ul><p>Stanford is an equal opportunity employer and all qualified applicants will receive consideration without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other characteristic protected by law.</p>\n\n<p>Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of the job.</p>\n\n<p>Location: Graduate School of Education, California, United States</p>\n\n<p>To be considered for this position please visit our web site and apply on line at the following link: <a href=\"http://apptrkr.com/1217608\">http://apptrkr.com/1217608</a></p>\n\n<p>Stanford is an equal opportunity employer and all qualified applicants will receive consideration without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other characteristic protected by law.</p>\n\n<p>Copyright ©2017 Jobelephant.com Inc. All rights reserved.</p>\n\n<p><a href=\"https://www.jobelephant.com/\">https://www.jobelephant.com/</a></p>\n\n<p>jeid-05d63804f14ae4448f93ad26d15c3a86</p>",
    "how_to_apply": "<p>To be considered for this position please visit our web site and apply on line at the following link: <a href=\"http://apptrkr.com/1217608\">http://apptrkr.com/1217608</a></p>",
    "company": "Stanford University",
    "company_url": "http://www.stanford.edu",
    "company_logo": "http://github-jobs.s3.amazonaws.com/f9bdce58-5221-11e8-9d87-3995757c8174.png",
    "url": "http://jobs.github.com/positions/01d286c4-5222-11e8-8522-875e5b9b32ed"
  },
  {
    "id": "ba2b9804-4fe9-11e8-9d6b-38cfb2e22fc8",
    "created_at": "Fri May 04 22:23:38 UTC 2018",
    "title": "Software Engineer, Service Backend",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<p>Every day, SmartNews analyzes millions of URLs to deliver the top articles that matter in near-real time to millions of users around the world. Our backend engineers ensure that we can respond to volumes exceeding &gt;1M requests/min—with content that is dynamically personalized for each user. </p>\n\n<p>With more than 25M downloads, SmartNews is one of the most popular news apps. We use machine learning to power news discovery and deliver better, higher quality recommendations.</p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li>Design and implement core backend systems</li>\n<li>Analyze and improve stability, efficiency, and scalability of various systems</li>\n</ul><p><em>Minimum Qualifications</em></p>\n\n<ul>\n<li>Over 5 years of experience in backend development</li>\n<li>Coding experience in Java, Kotlin, or Scala</li>\n<li>Experience operating and maintaining a JVM-based application</li>\n<li>Experience developing on top of a web framework (e.g. Spring Boot, Ruby on Rails, etc.)</li>\n<li>Working knowledge of HTML5, CSS3, and JavaScript</li>\n</ul><p><em>Preferred Qualifications</em></p>\n\n<ul>\n<li>Experience with AWS</li>\n<li>Experience developing and operating a high-traffic web service</li>\n<li>Good understanding of JVM internals</li>\n<li>Strong interest in news media and our mission to deliver high quality information to the world</li>\n</ul>",
    "how_to_apply": "<p><a href=\"https://smartnews.workable.com/j/F7FA50AE01\">https://smartnews.workable.com/j/F7FA50AE01</a></p>",
    "company": "SmartNews",
    "company_url": "http://www.smartnews.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/b0d8fb52-4fe9-11e8-9146-16b2d95d2c66.png",
    "url": "http://jobs.github.com/positions/ba2b9804-4fe9-11e8-9d6b-38cfb2e22fc8"
  },
  {
    "id": "bacabff0-4fb3-11e8-8fe9-deb3aabe2fef",
    "created_at": "Fri May 04 15:56:38 UTC 2018",
    "title": "Content Partner Engineer - Apple TV",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The AMP Video team is looking for an experienced engineer with a real passion for delivering first in class home entertainment solutions. You will work with talented engineers in a dynamic, technically demanding environment.<br>\nThe individual is be self-motivated, a great communicator, an excellent problem solver and a quick study. Very strong technical skills and a track record of multi-tasking is a requirement.</p>\n\n<p> \nKey Qualifications:  </p>\n\n<ul>\n<li>2 to 6+ years experience with video technologies including HTTP live streaming</li>\n<li>Solid understanding of computer science fundamentals (data structures, design, performance, debugging, ...)</li>\n<li>Extensive experience with scripting languages, in particular Javascript, but others such as python or bash are helpful too.</li>\n<li>Strong experience with data interchange formats such as XML, JSON</li>\n<li>Experience with Swift and Objective C</li>\n<li>Experience with iOS and tvOS app development and release</li>\n<li>Comfortable using a shell environment and common system utilities such as ssh, grep, tail</li>\n<li>Experience in QA/QC, issue tracking and documentation</li>\n<li>Ability to work with and lead multiple projects and timelines, so time management will be crucial.</li>\n</ul><p>Description:<br>\nProvide support to external partners as they integrate their content with Apple TV App, and other Video features.</p>\n\n<p>Support external partners by investigating issues and help to provide solutions for integration.</p>\n\n<p>Evaluate partner video streams, and serve as liaison to internal video groups to help resolve issues.</p>\n\n<p>Responsible for reporting vendor progress and tracking issues to resolution.</p>\n\n<p>Responsible for gathering vendor feedback on new feature requests.\n </p>\n\n<p>Education:<br>\nBS CS/CE/EE or equivalent experience</p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 113306180\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=01be8f26b7c695f9d645efe336686c47\">https://ars2.equest.com/?response_id=01be8f26b7c695f9d645efe336686c47</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/aa00df74-4fb3-11e8-9bdb-bdd5fd689538.jpeg",
    "url": "http://jobs.github.com/positions/bacabff0-4fb3-11e8-8fe9-deb3aabe2fef"
  },
  {
    "id": "bd97a6e6-4e71-11e8-834f-97977b013641",
    "created_at": "Thu May 03 01:45:29 UTC 2018",
    "title": "System Software Engineer",
    "location": "Mountain View/ Eugene/Tokyo/Remote",
    "type": "Full Time",
    "description": "<p>Game Closure is on the hunt for System Software Engineers to help us build the social games that guide the development of our mobile game engine. We are a 45 ­strong and growing team with offices in Mountain View, California, Oregon and Tokyo. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!</p>\n\n<p>As a System Software Engineer at Game Closure, you will play a pivotal role in creating a platform to revolutionize the mobile game development industry. Our engineers are generally amazing at something and great at everything else. We write cross-­compilers, custom browsers, ARM7 assembly, GPU shaders, Node.js &amp; Python back­ends, JavaScript game APIs and tools, and whatever else it takes. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.</p>\n\n<p>The Role:</p>\n\n<ul>\n<li>Be a key member of a high performing software engineering team.</li>\n<li>Play a critical role in day-­to-­day coding, performance profiling, optimization, and general troubleshooting.</li>\n<li>Collaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.</li>\n<li>Architect and code sophisticated client/server systems for mobile gaming.</li>\n<li>Learn from and mentor other engineers on your team.\n-Take ownership of your projects to make them the best they can possibly be.</li>\n<li>Provide valuable input on the company's long-term engineering roadmap and help identify areas of opportunity for improvement.</li>\n<li>Define the cutting edge of social gaming!</li>\n</ul><p>Desired Skills:</p>\n\n<ul>\n<li>Bachelor's degree in Computer Science or related field, or equivalent experience.</li>\n<li>3+ years of professional software engineering experience.</li>\n<li>Experience writing clean, testable, high­-quality code with a special focus on mobile performance.</li>\n<li>Solid familiarity with 3rd party SDKs, analytics, and A/B testing in mobile games.</li>\n<li>Ability to interact with peers in a constructive and productive style.</li>\n<li>Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.</li>\n<li>Familiarity with git, svn, or other VCS.</li>\n<li>Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.</li>\n<li>Strong team player with a positive attitude.</li>\n</ul><p>Bonus:</p>\n\n<ul>\n<li>Canvas animation work</li>\n<li>2+ years of game development experience with multiple shipped titles</li>\n<li>Both Android and iOS game development experience</li>\n<li>Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)</li>\n</ul>",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/gameclosure/8de920f5-3220-4648-b5a7-7e8b2c382e51?lever-origin=applied&amp;lever-source%5B%5D=github\">https://jobs.lever.co/gameclosure/8de920f5-3220-4648-b5a7-7e8b2c382e51?lever-origin=applied&amp;lever-source%5B%5D=github</a></p>",
    "company": "Game Closure",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/af38bcc0-4e71-11e8-916f-e02499e1e14e.png",
    "url": "http://jobs.github.com/positions/bd97a6e6-4e71-11e8-834f-97977b013641"
  },
  {
    "id": "2782ebb6-4a75-11e8-9ebb-47d33cbed1ee",
    "created_at": "Fri Apr 27 23:50:57 UTC 2018",
    "title": "Senior Software Engineer",
    "location": "Monrovia, CA",
    "type": "Full Time",
    "description": "<p>ChromoLogic is actively engaged in multiple cutting edge applied research and development programs. The ideal candidate will have a strong interest in developing software for telehealth, medical diagnostics, and industrial applications. We bring a unique, multi-disciplinary approach to compelling scientific challenges and our core capabilities stem from the diverse talents of our team. We provide a highly creative, collaborative and challenging work environment where each individual can not only attain their full potential, but also grow and learn new skills. </p>\n\n<p>Job Duties </p>\n\n<ul>\n<li>Contribute toward the company’s ongoing programs in Biomedical and Industrial Solutions business</li>\n<li>Develop, test and maintain a wide range of software applications</li>\n<li>Design and document software interfaces and architecture</li>\n<li>Work with product management to deliver delightful user experiences to our customers</li>\n<li>Work closely with QA to ensure high-quality software releases</li>\n<li>Manage through uncertainty in an innovative, multidisciplinary team environment </li>\n<li>Understand how to prioritize tasks based on a product roadmap and drive execution</li>\n<li>Help lead software development processes</li>\n</ul><p>Multiple positions open</p>\n\n<p>Skills Requirements </p>\n\n<ul>\n<li>BS degree in Computer Science, Computer Engineering, or equivalent</li>\n<li>3-5+ years of industrial experience developing software products</li>\n<li>Proficiency in Python and C/C++</li>\n<li>Exposure to SQL and/or NoSQL</li>\n<li>Comfortable using Git</li>\n<li>Experience writing unit and integration tests</li>\n<li>JavaScript experience is a plus</li>\n<li>Image processing or computer vision experience preferred</li>\n<li>Interest in user interface design and development</li>\n<li>Well versed in software development and documentation best practices</li>\n<li>Good technical communication skills, written and verbal</li>\n<li>US Citizen or US Permanent Resident due to government contract requirements</li>\n</ul>",
    "how_to_apply": "<p>Special instructions regarding requested documents:</p>\n\n<p>Please email us your cover letter and resume to careers@chromologic.com. In order to review your resume you MUST answer the following questions:</p>\n\n<ol>\n<li><p>Your Name and the position you are applying for?</p></li>\n<li><p>Are you authorized to work in United States full-time? [Yes/No] </p></li>\n<li><p>When will you be available to start work [Date]? </p></li>\n<li><p>Are you currently employed? [Yes/No]</p></li>\n</ol>",
    "company": "ChromoLogic LLC",
    "company_url": "http://www.chromologic.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/f7298d1c-4a74-11e8-98ea-6ae6cd68e7a2.png",
    "url": "http://jobs.github.com/positions/2782ebb6-4a75-11e8-9ebb-47d33cbed1ee"
  },
  {
    "id": "d37afd36-4a67-11e8-9114-574d811607c3",
    "created_at": "Fri Apr 27 22:11:40 UTC 2018",
    "title": "Senior Software Engineer (SF or NYC, $140-160K)",
    "location": "San Francisco or New York",
    "type": "Full Time",
    "description": "<p><a href=\"https://www.nylas.com/\">Nylas</a> is a product built for engineers, by engineers. We make it easy to add email, contacts, and calendars to any app. By being at the core of business communication, we believe we can shape the future of how people work.</p>\n\n<p>We’re looking for a Senior Software Engineer to help us scale and build new products on top of our APIs. Right now, our open-source Python sync engine regularly archives terabytes of data across a massive SQL cluster, and our Flask APIs handle tens of millions of requests a day. </p>\n\n<p>We make a big effort to create an inclusive environment that is open, frank, and empowering. If you’re excited to architect complex systems with a small, rapidly-growing team, come join us!</p>\n\n<h2>About Nylas</h2>\n\n<p>Nylas makes it easy to add email, contacts, and calendars to any app. We have spent the last four years developing an API that is clean, performant, secure, and saves our customers an average of 18 months of development time. Since a user’s inbox has more data than your typical startup, we’ve had to solve some pretty challenging big data, high speed, and availability requirements.</p>\n\n<p>Nylas has raised over $8M from 8VC, Data Collective, Fuel Capital, SV Angel and more. Our team is based in San Francisco and members have previously worked at Dropbox, Google, Facebook, Microsoft, Oracle, SAP, and VMware. </p>\n\n<p>Our team collaboratively wrote about our values, benefits, perks, and published them in our open-source handbook. Learn more them here: <a href=\"https://www.keyvalues.com/nylas\">https://www.keyvalues.com/nylas</a>.</p>\n\n<h2>About This Job</h2>\n\n<p>In this job you will:</p>\n\n<ul>\n<li>Own and ship new features from inception to deployment in a highly-collaborative environment</li>\n<li>Mentor fellow engineers and help set engineering norms and best practices</li>\n<li>Work on projects like sharding and scaling existing systems, implementing new Exchange protocols, or architecting mail data processing pipelines</li>\n<li>Work to improve the day to day workflow, developer experience, and velocity of your team</li>\n<li>Be an investigator for tricky, critical customer issues</li>\n<li>If you’re up for it, you can even talk at conferences, write blog posts, and make strong showings at local events!</li>\n</ul><p>What makes you a great fit for this role:</p>\n\n<ul>\n<li>You love working collaboratively with your fellow engineers on a daily basis</li>\n<li>You’re pragmatic as an engineer and empathize deeply with the customers using your product</li>\n<li>You have experience architecting or helping build a product’s architecture at scale, including large infrastructural and data challenges - especially across multiple servers</li>\n<li>You love finding ways to make your whole team’s life better and would love to have a hand in shaping your team’s growth and culture</li>\n<li>You love using Python OR are excited by the prospect of using Python on a daily basis. You’re also excited about using different parts of our tech stack:\n\n<ul>\n<li>Backend: Python with MyPy, Flask, SQL, Redis, AWS, nginx, ElasticSearch, Linux</li>\n<li>Frontend: Flow-typed Javascript, React/Redux</li>\n<li>DevOps: Ansible, AWS</li>\n</ul>\n</li>\n</ul><p>Benefits:</p>\n\n<ul>\n<li>Salary is between $140,000 and $160,000</li>\n<li>We have offices in both San Francisco and New York City with an occasional work-from-home policy</li>\n<li>We offer full medical/vision/dental insurance, including families</li>\n<li>Generous vacation (including mandatory 10-consecutive-biz-day vacation every year)</li>\n<li>401k plan</li>\n<li>Commuter benefits in SF + $100 monthly Lyft credit</li>\n<li>Lunch provided every day!</li>\n<li>Gym membership reimbursement up to $70/month </li>\n<li>Book clubs (books purchased for these are free)</li>\n<li>Massages every other Wednesday (by appt)</li>\n<li>$1000 annual allowance for continuing education like classes and conferences</li>\n</ul>",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:mj@teamtheory.co\">mj@teamtheory.co</a> or apply directly at <a href=\"https://nylas.workable.com/jobs/687602\">https://nylas.workable.com/jobs/687602</a>.</p>",
    "company": "Nylas",
    "company_url": "https://www.nylas.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/8dd53bfc-4a67-11e8-83c5-6fec43335155.png",
    "url": "http://jobs.github.com/positions/d37afd36-4a67-11e8-9114-574d811607c3"
  },
  {
    "id": "a322bd0e-4977-11e8-82a2-f8413ac78eba",
    "created_at": "Thu Apr 26 17:31:22 UTC 2018",
    "title": "Senior Software Engineer, Senior Software Engineer, Informatica Cloud Service",
    "location": "Redwood City, California US",
    "type": "Full Time",
    "description": "<p><strong>Job Number:</strong> 23194</p>\n\n<p>At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.</p>\n\n<p>A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.</p>\n\n<p><strong>Senior Software Engineer,  Informatica Cloud Service</strong></p>\n\n<p><strong>Our Company</strong></p>\n\n<p>Informatica Corporation is the world’s number one independent provider of data integration software. Thousands of enterprises worldwide depend on Informatica data integration, data quality, and big data solutions to access, integrate, and trust their information assets residing on premise and in the Cloud.</p>\n\n<p><strong>Our Team</strong></p>\n\n<p>The Informatica Cloud team is responsible for building the leading integration-Platform-as-a-Service (iPaaS) product to provide Data Integration, Data Quality, Information Lifecycle Management, Test Data Management, Master Management and other Information Management solution as a service on the cloud. Thousands of customers rely on our service for moving billions of records every day.</p>\n\n<p><strong>Your Opportunity</strong></p>\n\n<p>As a senior software engineer of the Informatica Cloud team, you will work with a world class engineers to design and build the next generation microservices based cloud platform using the latest cutting-edge cloud technology, such as Amazon AWS, Saleforce.com, Microsoft Azure and Docker, to provide non-disruptive cloud data integration service to our customers</p>\n\n<p><strong>Our Ideal Candidate</strong></p>\n\n<p>You are an experienced full stack software engineer with system expertise. You are motivated to combine the art of design with the art of programming. You have experience on designing and developing services for modern large-scale data warehouse and data lake. You have experience in developing Data Integration (DI) tools. You have strong knowledge on Web UI technology, such as JQuery, Ajax, HTML5/CSS. You have experience in java server development and technologies such as Spring and Hibernate. You enjoy working on technically challenging projects. You are willing to work on many different projects, and interested in assuming various responsibilities. You are comfortable working in a fast-pace, agile development environment, self-motivated with strong inter-personal and communication skill.</p>\n\n<p><strong>Your Responsibilities</strong></p>\n\n<p>The successful candidate will be based in Redwood City, CA and will:</p>\n\n<ul>\n<li>  Part of an experienced, energetic team on a rapid, agile development schedule</li>\n<li>  Participates in the development, specification and the design of the product.</li>\n<li>  Feature development and follow through with other team members to ensure high quality and predictable delivery</li>\n<li>  Write unit, integration and automated tests for the developed features</li>\n<li>  Provide detailed estimates of projects and meet project schedules</li>\n<li>  Work with QA team to ensure minimal regressions and comprehensive customer-centric testing</li>\n<li>  Give iteration demos to show progress against requirements</li>\n<li>  Review QA test specifications and feature documents</li>\n<li>  Participate in internal/cross team meetings, scoping, decision making and technical documentation</li>\n<li>  Mentor junior engineers on technical, architectural, design and related issues</li>\n<li>  Assisting customers and field engineers with troubleshooting issues and problems</li>\n</ul><p><strong>Your Qualifications</strong></p>\n\n<ul>\n<li>  3+ years of Java/J2EE enterprise software development experience, preferably with data-intensive and multi-threaded service-oriented cloud products with high performance and scalability requirements</li>\n<li>  Experience in web client technologies, including but not limited to HTML5, CSS, Angular JS, Bootstrap, JQuery, JavaScript, Strut</li>\n<li>  Hands-on experience of J2EE Spring Framework, Persistence Framework, OSGi, Java SDK, web service protocol stack, REST, XML, JSON preferred, XPath</li>\n<li>  Knowledge of software implementation best practices</li>\n<li>  Experience with cloud application development, deployment, operation, and support preferred</li>\n<li>  Solid knowledge of relational database system fundamentals desired</li>\n<li>  Knowledge of latest Container technology, such as Docker, preferred.</li>\n<li>  Experience in Agile development methodologies and release management techniques</li>\n<li>  Able to work independently with little direct supervision and take initiative; willing to mentor and develop others</li>\n<li>  Proven ability to work well with others in a fast paced, iterative product definition and development environment</li>\n<li>  Strong analytical and troubleshooting skills</li>\n<li>  BS in Computer Science or a related technical discipline; advanced degree preferred</li>\n</ul><p>Informatica offers a competitive compensation package that includes base salary, medical, retirement and employee stock purchase (ESP) programs, flexible time off and more. Our generous benefits vary depending on your geographic work location. It’s an exciting time to work at Informatica. You can learn more about our company, our products and our services at <a href=\"http://www.informatica.com\">www.informatica.com</a>. We are an Equal Opportunity Employer (EOE).</p>\n\n<p>All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.</p>",
    "how_to_apply": "<p><a href=\"https://informatica.gr8people.com/index.gp?method=cappportal.showJob&amp;sysLayoutId=122&amp;opportunityId=23194&amp;SID=495\">https://informatica.gr8people.com/index.gp?method=cappportal.showJob&amp;sysLayoutId=122&amp;opportunityId=23194&amp;SID=495</a></p>",
    "company": "Informatica",
    "company_url": "http://www.informatica.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/ae0efb06-497c-11e8-8632-7ccc58146108.png",
    "url": "http://jobs.github.com/positions/a322bd0e-4977-11e8-82a2-f8413ac78eba"
  },
  {
    "id": "9f891a9e-4977-11e8-9f66-9072f030ce32",
    "created_at": "Thu Apr 26 17:31:16 UTC 2018",
    "title": "Principal Front End Engineer, Informatica Cloud Service",
    "location": "Redwood City, California US",
    "type": "Full Time",
    "description": "<p><strong>Job Number:</strong> 23156</p>\n\n<p>At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.</p>\n\n<p>A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.</p>\n\n<p><strong>Principal Front End  Engineer, Informatica Cloud Service</strong></p>\n\n<p><strong>Our Company</strong></p>\n\n<p>Informatica Corporation is the world’s number one independent provider of data integration software. Thousands of enterprises worldwide depend on Informatica data integration, data quality, and big data solutions to access, integrate, and trust their information assets residing on premise and in the Cloud.</p>\n\n<p><strong>Our Team</strong></p>\n\n<p>The Informatica Cloud team is responsible for building the leading integration-Platform-as-a-Service (iPaaS) product to provide Data Integration, Data Quality, Information Lifecycle Management, Test Data Management, Master Management and other Information Management solution as a service on the cloud. Thousands of customers rely on our service for moving billions of records every day.</p>\n\n<p><strong>Your Opportunity</strong></p>\n\n<p>As a software engineer of the Informatica Cloud team, you will work with a world class engineers to design and build the next generation cloud platform.</p>\n\n<p><strong>Our Ideal Candidate</strong></p>\n\n<p>You are a professional software engineer with full-stack web application development experience. You have skills to create well-designed web interfaces resulting in rich, intuitive user experiences, and deliver high-quality, modular code for complex web UI components and pages.</p>\n\n<p>You enjoy working on technically challenging projects. You are willing to work on many different projects, and interested in assuming various responsibilities. You are comfortable working in a fast-pace development environment, self-motivated with strong inter-personal and communication skill.</p>\n\n<p><strong>Your Responsibilities</strong></p>\n\n<p>The successful candidate will be based in Redwood City, CA and will:</p>\n\n<ul>\n<li>  Leading and driving the delivery and architecture for large functional areas</li>\n<li>  Investigate, design, and develop the features individually or with a small team</li>\n<li>  Building interactive, responsive and scalable easy-to-use user interfaces</li>\n<li>  Participate in feature development and follow through with other team members to ensure high quality and predictable delivery</li>\n<li>  Work with QA team to ensure minimal regressions and comprehensive customer-centric testing</li>\n<li>  Participate in internal/cross team meetings, scoping, decision making and technical documentation</li>\n<li>  Assisting customers and field engineers with troubleshooting issues and problems</li>\n</ul><p><strong>Your Qualifications</strong></p>\n\n<ul>\n<li>  8+ years of enterprise software development experience, preferably with data-intensive and multi-threaded service-oriented cloud products with high performance and scalability requirements</li>\n<li>  5+ years of experience in web client technologies such as HTML, CSS, Javascript and AJAX.</li>\n<li>  5+ years of experience of JavaScript frameworks and libraries, such as JQuery, Angular, Dojo or Backbone</li>\n<li>  Hands-on experience of J2EE Spring Framework, Persistence Framework, Java SDK, REST, XML, JSON</li>\n<li>  Experience of big data process platform, such as Hadoop or Spark, is a plus</li>\n<li>  Strong Object Oriented Programming Skills. Good understanding of data structures and algorithms.</li>\n<li>  Experience with cloud application development, deployment, operation, and support</li>\n<li>  Experience in Agile development methodologies and release management techniques</li>\n<li>  Ability to work independently with little direct supervision</li>\n<li>  Strong analytical and troubleshooting skills</li>\n<li>  BS in Computer Science or a related technical discipline; advanced degree preferred</li>\n</ul><p>All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.</p>",
    "how_to_apply": "<p><a href=\"https://informatica.gr8people.com/index.gp?method=cappportal.showJob&amp;sysLayoutId=122&amp;opportunityId=23156&amp;SID=495\">https://informatica.gr8people.com/index.gp?method=cappportal.showJob&amp;sysLayoutId=122&amp;opportunityId=23156&amp;SID=495</a></p>",
    "company": "Informatica",
    "company_url": "http://www.informatica.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/ae0efb06-497c-11e8-8632-7ccc58146108.png",
    "url": "http://jobs.github.com/positions/9f891a9e-4977-11e8-9f66-9072f030ce32"
  },
  {
    "id": "97786436-4977-11e8-8fe4-cb6755acd02c",
    "created_at": "Thu Apr 26 17:31:02 UTC 2018",
    "title": "Senior Devops Engineer, Informatica Cloud Operations",
    "location": "Redwood City, California US",
    "type": "Full Time",
    "description": "<p><strong>Job Number:</strong> 23110</p>\n\n<p>At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.</p>\n\n<p>A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.</p>\n\n<p><strong>Your Opportunity:</strong></p>\n\n<p>Imagine yourself working for the leading independent software provider focused on delivering transformative innovation for the future of all things data. Organizations around the world rely on Informatica to realize their information potential and drive top business imperatives. As a University Graduate at Informatica, you will be exposed to innovativeculture, challenging work and a fast moving, results oriented environment. As a software development engineer, you will be responsible for creating and certifying code for Informatica’s next generation platform to handle the volume, velocity and variety of structured and unstructured data. It could be enterprise and partner data from hosted cloud services and on-premise deployments or arbitrary data from social web sites and media.</p>\n\n<p><strong>Our Ideal Candidate:</strong></p>\n\n<p>You are a self-motivated professional who demonstrates the ability to quickly grasp new technologies and products in addition to solving complex problems. You are bright and intellectually curious; deal with concepts and complexity comfortably; are capable, adaptable and agile. You like the excitement of working in a fast-paced environment. You like being creative and are open to new ideas and ways of doing things. You are able to work independently as well as within a team spanning multiple regions. In addition, you have the following attributes:</p>\n\n<ul>\n<li>  Ability to quickly learn new technologies in a dynamic environment</li>\n<li>  Strong Analytical and problem solving skills</li>\n<li>  Accurately assess critical factors for success and mitigate risk on deliverables</li>\n<li>  Proactively share technical knowledge and best practices with team members</li>\n<li>  Possess excellent written and verbal skills</li>\n<li>  Articulate ideas and thoughts clearly and easily</li>\n<li>  Interact well with team leaders, peers, junior staff and other managers at various positions</li>\n</ul><p><strong>Your Responsibilities:</strong></p>\n\n<ul>\n<li>  Write clean maintainable product code; develop and maintain the tests; work with the product management and product delivery teams on defining and validating the requirements; handle scoping, planning, internal and external dependencies for the features that you own</li>\n<li>  Maintain design specifications based on implementation time changes</li>\n<li>  Contribute to all aspects of the engineering process, i.e. agile, design reviews, etc.</li>\n<li>  Handle internal and external dependencies for the features that you own</li>\n<li>  Collaborate with geographically dispersed, cross-functional teams in an Agile environment</li>\n<li>  Participate in internal/cross team meetings, scoping, decision making and technical documentation reviews</li>\n</ul><p><strong>Your Qualifications:</strong></p>\n\n<ul>\n<li>  Graduating between December 2016 and June 2017 with a BS/MS in Computer Science or equivalent</li>\n<li>  Strong programming skills in one or more of the following languages: Java, JavaScript, C, C++, Python</li>\n<li>  Knowledge in Relational databases concepts</li>\n<li>  Object Oriented design, data structures and programming</li>\n<li>  Experience with jQuery or other JavaScript frameworks</li>\n<li>  Operating Systems, multi-threading and algorithm knowledge is preferred</li>\n</ul><p><strong>Additional Information</strong></p>\n\n<p>Informatica offers a competitive compensation package that includes base salary, medical, retirement and unlimited flexible time off and more. Our generous benefits vary depending on your geographic work location. It’s an exciting time to work at Informatica. You can learn more about our company, our products and our services at <a href=\"http://www.informatica.com\">www.informatica.com</a>. We are an Equal Opportunity Employer (EOE).</p>\n\n<p>All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.</p>",
    "how_to_apply": "<p><a href=\"https://informatica.gr8people.com/index.gp?method=cappportal.showJob&amp;sysLayoutId=122&amp;opportunityId=23110&amp;SID=495\">https://informatica.gr8people.com/index.gp?method=cappportal.showJob&amp;sysLayoutId=122&amp;opportunityId=23110&amp;SID=495</a></p>",
    "company": "Informatica",
    "company_url": "http://www.informatica.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/ae0efb06-497c-11e8-8632-7ccc58146108.png",
    "url": "http://jobs.github.com/positions/97786436-4977-11e8-8fe4-cb6755acd02c"
  },
  {
    "id": "3b9dbe52-48cf-11e8-947f-1bf400757f87",
    "created_at": "Wed Apr 25 21:26:22 UTC 2018",
    "title": "Staff Software Engineer- Full Stack",
    "location": "San Francisco, CA",
    "type": "Full Time",
    "description": "<p><strong>About the Engineering Org</strong></p>\n\n<p>We are a growing, hands-on, flat organization. Because we are still small, it means everyone is a generalist and allows for our engineers to take on multiple roles and challenges not narrowly defined by titles.  Regardless of who you are on the engineering team, you will contribute to and have a big impact on the final product from day one. The opportunity for growth and development here is incredible. We have a strong culture of mentoring and promoting from within! We place a lot of emphasis on good engineering practices while retaining the flexibility of allowing each engineering team to have independent agile processes. Diversity is important to us, and we treat each other with respect and empathy.</p>\n\n<p><strong>About the Role</strong></p>\n\n<p>We are looking for several Staff Engineers to be a part of our Growth, E-Commerce and Community Experience teams. As a member of these teams, you could be working on exciting projects from revamping our e-commerce architecture to building products that will help independent designers start, scale and grow their business on Minted.com.  As part of our organization, you will tackle various engineering challenges using cutting edge technology and will have the opportunity to work with engineers across multiple disciplines and backgrounds.</p>\n\n<p><strong>About you</strong></p>\n\n<p>We are looking for Staff Engineers that can leverage their deep technical experience to help design and build Minted’s software systems. The ideal candidate will have strong technical and problem-solving skills to help architect and scale our cloud-based system to match Minted’s growth trajectory.</p>\n\n<p><strong>Specific Responsibilities</strong></p>\n\n<ul>\n<li>Design and develop a beautiful, responsive and fun-filled world-class web experience</li>\n<li>Own high impact and high visibility engineering projects end to end</li>\n<li>Build systems and services that have an immediate impact on our artist community and customers.</li>\n<li>Build and maintain backend architecture for our high-traffic e-commerce platform that is scalable, extensible, and efficient in usage of system resources (memory, disk, I/O, etc)</li>\n<li>Collaborate with product development, user experience, production and artist relations teams to deliver projects with measurable business results</li>\n<li>Ensure a high-quality codebase with design and code review as well as automated test coverage</li>\n<li>Advance your technical knowledge and skill set with talks, training sessions, and 1:1 mentorship of junior engineers</li>\n</ul><p><strong>Experience and Skills</strong></p>\n\n<ul>\n<li>5+ years professional experience as a software developer</li>\n<li>BS in Computer Science preferred</li>\n<li>Obsession with writing clean code</li>\n<li>Technical design skills with an emphasis on distributed and/or cloud-based design and scaling</li>\n<li>Experience working on and an understanding of both client-side and server-side code</li>\n<li>Experience designing complex software systems and accurately estimating scope and risks</li>\n<li>Strong programming skills preferably in Python, Java, PHP, Javascript</li>\n<li>Experience with SQL, database modeling, and ORMs</li>\n<li>Experience dealing with resource contention and scalability issues in multi-threaded web applications</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Ability to juggle competing priorities in a fast-moving dynamic environment</li>\n</ul><p><strong>Bonus Points</strong></p>\n\n<ul>\n<li>Experience with Apache Flink, Apache Beam, Google Cloud Dataflow, Apache Spark Streaming, or other related technologies such as Hadoop</li>\n<li>Experience working in a fast-paced, agile e-commerce environment</li>\n<li>Experience with Amazon Web Services, specifically DynamoDB, SQS, S3, SNS, EC2, CloudFormation, ELB, VLC, and ASG</li>\n<li>Experience with Packer, Docker, Ansible, Puppet</li>\n<li>Experience in React.js, HTML, CSS</li>\n</ul><p><strong>About Minted</strong></p>\n\n<p>Minted is a lifestyle brand and design marketplace connecting you with the world’s best artists to create something one of a kind. Minted crowdsources graphic design and artwork from a global community of independent artists and sells these as products addressing the $10 billion stationery market, $48 billion art market, and $100 billion home decor market.</p>\n\n<p>Minted’s mission is to enable the design independence of both consumers and artists around the world, and the company is a platform for the strongest emerging artists in the world to be seen and discovered. We aim to build a lasting brand representing the most commercially successful design community in the world. Minted was founded by successful serial entrepreneur Mariam Naficy.</p>\n\n<p>Minted is located in a beautiful office in downtown San Francisco and is backed by Benchmark Capital, IDG Ventures SF, Menlo Ventures, and angel investors including Marissa Mayer of Yahoo and Jeremy Stoppelman of Yelp. Minted is comprised of an experienced and entrepreneurial team. We come from Google, Amazon, Microsoft, eBay, Yahoo, and Goldman Sachs and numerous disruptive startups. We are a passionate, creative, ambitious team. We provide a great opportunity to work with a stellar team and on a world-changing mission, all supported by a proven business model.</p>",
    "how_to_apply": "<p>Apply through this link: <a href=\"https://app.jobvite.com/j?cj=oc0q7fwt&amp;s=GitHub\">https://app.jobvite.com/j?cj=oc0q7fwt&amp;s=GitHub</a></p>",
    "company": "Minted",
    "company_url": "https://www.minted.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/2182e592-48cf-11e8-8111-a6e811d5377c.jpg",
    "url": "http://jobs.github.com/positions/3b9dbe52-48cf-11e8-947f-1bf400757f87"
  },
  {
    "id": "9d0d8860-4821-11e8-9c9f-43fc9bfb26f0",
    "created_at": "Wed Apr 25 00:43:36 UTC 2018",
    "title": "Software Engineer- Full Stack ",
    "location": "San Francisco, CA",
    "type": "Full Time",
    "description": "<p><strong>About the Engineering Org</strong></p>\n\n<p>We are a growing, hands-on, flat organization. Because we are still small, it means everyone is a generalist and allows for our engineers to take on multiple roles and challenges not narrowly defined by titles.  Regardless of who you are on the engineering team, you will contribute to and have a big impact on the final product from day one. The opportunity for growth and development here is incredible. We have a strong culture of mentoring and promoting from within! We place a lot of emphasis on good engineering practices while retaining the flexibility of allowing each engineering team to have independent agile processes. Diversity is important to us, and we treat each other with respect and empathy.</p>\n\n<p><strong>About the Role</strong></p>\n\n<p>We are looking for several Full Stack Software Engineers to be a part of our Growth, E-Commerce and Community Experience teams. As a member of these teams, you could be working on exciting projects from revamping our e-commerce architecture to building products that will help independent designers start, scale and grow their business on Minted.com.  As part of our organization, you will tackle various engineering challenges using cutting edge technology and will have the opportunity to work with engineers across multiple disciplines and backgrounds.<br>\nAbout you</p>\n\n<p>We are looking for Software Engineers that can leverage their deep technical experience to help design and build Minted’s software systems. The ideal candidate will have strong technical and problem-solving skills to help architect and scale our cloud-based system to match Minted’s growth trajectory.</p>\n\n<p><strong>Specific Responsibilities</strong></p>\n\n<ul>\n<li>Design and develop a beautiful, responsive and fun-filled world-class web experience</li>\n<li>Own high impact and high visibility engineering projects end to end</li>\n<li>Build systems and services that have an immediate impact on our artist community and customers.</li>\n<li>Build and maintain backend architecture for our high-traffic e-commerce platform that is scalable, extensible, and efficient in usage of system resources (memory, disk, I/O, etc)</li>\n<li>Collaborate with product development, user experience, production and artist relations teams to deliver projects with measurable business results</li>\n<li>Ensure a high-quality codebase with design and code review as well as automated test coverage</li>\n<li>Advance your technical knowledge and skill set with talks, training sessions, and 1:1 mentorship of junior engineers</li>\n</ul><p><strong>Experience and Skills</strong></p>\n\n<ul>\n<li>1+ year professional experience as a software developer</li>\n<li>BS in Computer Science preferred</li>\n<li>Obsession with writing clean code</li>\n<li>Technical design skills with an emphasis on distributed and/or cloud-based design and scaling</li>\n<li>Experience working on and an understanding of both client-side and server-side code</li>\n<li>Experience designing complex software systems and accurately estimating scope and risks</li>\n<li>Strong programming skills preferably in Python, Java, PHP, Javascript</li>\n<li>Experience with SQL, database modeling, and ORMs</li>\n<li>Experience dealing with resource contention and scalability issues in multi-threaded web applications</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Ability to juggle competing priorities in a fast-moving dynamic environment</li>\n</ul><p><strong>Bonus Points</strong></p>\n\n<ul>\n<li>Experience with Apache Flink, Apache Beam, Google Cloud Dataflow, Apache Spark Streaming, or other related technologies such as Hadoop</li>\n<li>Experience working in a fast-paced, agile e-commerce environment</li>\n<li>Experience with Amazon Web Services, specifically DynamoDB, SQS, S3, SNS, EC2, CloudFormation, ELB, VLC, and ASG</li>\n<li>Experience with Packer, Docker, Ansible, Puppet</li>\n<li>Experience in React.js, HTML, CSS</li>\n</ul><p><strong>About Minted</strong></p>\n\n<p>Minted is a lifestyle brand and design marketplace connecting you with the world’s best artists to create something one of a kind. Minted crowdsources graphic design and artwork from a global community of independent artists and sells these as products addressing the $10 billion stationery market, $48 billion art market, and $100 billion home decor market.</p>\n\n<p>Minted’s mission is to enable the design independence of both consumers and artists around the world, and the company is a platform for the strongest emerging artists in the world to be seen and discovered. We aim to build a lasting brand representing the most commercially successful design community in the world. Minted was founded by successful serial entrepreneur Mariam Naficy.\nMinted is located in a beautiful office in downtown San Francisco and is backed by Benchmark Capital, IDG Ventures SF, Menlo Ventures, and angel investors including Marissa Mayer of Yahoo and Jeremy Stoppelman of Yelp. Minted is comprised of an experienced and entrepreneurial team. We come from Google, Amazon, Microsoft, eBay, Yahoo, and Goldman Sachs and numerous disruptive startups. We are a passionate, creative, ambitious team. We provide a great opportunity to work with a stellar team and on a world-changing mission, all supported by a proven business model.</p>",
    "how_to_apply": "<p>Apply at this link: <a href=\"https://app.jobvite.com/j?cj=o0xp7fwN&amp;s=GitHub\">https://app.jobvite.com/j?cj=o0xp7fwN&amp;s=GitHub</a></p>",
    "company": "Minted",
    "company_url": "https://www.minted.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/918b9752-4821-11e8-91e9-bc6e23a3cf4e.jpg",
    "url": "http://jobs.github.com/positions/9d0d8860-4821-11e8-9c9f-43fc9bfb26f0"
  },
  {
    "id": "f407cb6e-4815-11e8-861a-175845c608ef",
    "created_at": "Wed Apr 25 00:19:07 UTC 2018",
    "title": "Senior Software Engineer- Full Stack",
    "location": "San Francisco, CA",
    "type": "Full Time",
    "description": "<p><strong>About the Engineering Org</strong></p>\n\n<p>We are a growing, hands-on, flat organization. Because we are still small, it means everyone is a generalist and allows for our engineers to take on multiple roles and challenges not narrowly defined by titles.  Regardless of who you are on the engineering team, you will contribute to and have a big impact on the final product from day one. The opportunity for growth and development here is incredible. We have a strong culture of mentoring and promoting from within! We place a lot of emphasis on good engineering practices while retaining the flexibility of allowing each engineering team to have independent agile processes. Diversity is important to us, and we treat each other with respect and empathy.</p>\n\n<p><strong>About the Role</strong></p>\n\n<p>We are looking for several Senior Full Stack Software Engineers to be a part of our Growth, E-Commerce and Community Experience teams. As a member of these teams, you could be working on exciting projects from revamping our e-commerce architecture to building products that will help independent designers start, scale and grow their business on Minted.com.  As part of our organization, you will tackle various engineering challenges using cutting edge technology and will have the opportunity to work with engineers across multiple disciplines and backgrounds.   </p>\n\n<p><strong>About you</strong></p>\n\n<p>We are looking for Senior Software Engineers that can leverage their deep technical experience to help design and build Minted’s software systems. The ideal candidate will have strong technical and problem-solving skills to help architect and scale our cloud-based system to match Minted’s growth trajectory.</p>\n\n<p><strong>Specific Responsibilities</strong></p>\n\n<ul>\n<li>Design and develop a beautiful, responsive and fun-filled world-class web experience</li>\n<li>Own high impact and high visibility engineering projects end to end</li>\n<li>Build systems and services that have an immediate impact on our artist community and customers.</li>\n<li>Build and maintain backend architecture for our high-traffic e-commerce platform that is scalable, extensible, and efficient in usage of system resources (memory, disk, I/O, etc)</li>\n<li>Collaborate with product development, user experience, production and artist relations teams to deliver projects with measurable business results</li>\n<li>Ensure a high-quality codebase with design and code review as well as automated test coverage</li>\n<li>Advance your technical knowledge and skill set with talks, training sessions, and 1:1 mentorship of junior engineers</li>\n</ul><p><strong>Experience and Skills</strong></p>\n\n<ul>\n<li>3+ years professional experience as a software developer</li>\n<li>BS in Computer Science preferred</li>\n<li>Obsession with writing clean code</li>\n<li>Technical design skills with an emphasis on distributed and/or cloud-based design and scaling</li>\n<li>Experience working on and an understanding of both client-side and server-side code</li>\n<li>Experience designing complex software systems and accurately estimating scope and risks</li>\n<li>Strong programming skills preferably in Python, Java, PHP, Javascript</li>\n<li>Experience with SQL, database modeling, and ORMs</li>\n<li>Experience dealing with resource contention and scalability issues in multi-threaded web applications</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Ability to juggle competing priorities in a fast-moving dynamic environment</li>\n</ul><p><strong>Bonus Points</strong></p>\n\n<ul>\n<li>Experience with Apache Flink, Apache Beam, Google Cloud Dataflow, Apache Spark Streaming, or other related technologies such as Hadoop</li>\n<li>Experience working in a fast-paced, agile e-commerce environment</li>\n<li>Experience with Amazon Web Services, specifically DynamoDB, SQS, S3, SNS, EC2, CloudFormation, ELB, VLC, and ASG</li>\n<li>Experience with Packer, Docker, Ansible, Puppet</li>\n<li>Experience in React.js, HTML, CSS</li>\n</ul><p><strong>About Minted</strong></p>\n\n<p>Minted is a lifestyle brand and design marketplace connecting you with the world’s best artists to create something one of a kind. Minted crowdsources graphic design and artwork from a global community of independent artists and sells these as products addressing the $10 billion stationery market, $48 billion art market, and $100 billion home decor market.\nMinted’s mission is to enable the design independence of both consumers and artists around the world, and the company is a platform for the strongest emerging artists in the world to be seen and discovered. We aim to build a lasting brand representing the most commercially successful design community in the world. Minted was founded by successful serial entrepreneur Mariam Naficy.\nMinted is located in a beautiful office in downtown San Francisco and is backed by Benchmark Capital, IDG Ventures SF, Menlo Ventures, and angel investors including Marissa Mayer of Yahoo and Jeremy Stoppelman of Yelp. Minted is comprised of an experienced and entrepreneurial team. We come from Google, Amazon, Microsoft, eBay, Yahoo, and Goldman Sachs and numerous disruptive startups. We are a passionate, creative, ambitious team. We provide a great opportunity to work with a stellar team and on a world-changing mission, all supported by a proven business model.</p>",
    "how_to_apply": "<p>Apply through this link:  <a href=\"https://app.jobvite.com/j?cj=oWyp7fwK&amp;s=GitHub\">https://app.jobvite.com/j?cj=oWyp7fwK&amp;s=GitHub</a></p>",
    "company": "Minted",
    "company_url": "https://www.minted.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d7c663a6-4816-11e8-9589-2d15bae69b83.jpg",
    "url": "http://jobs.github.com/positions/f407cb6e-4815-11e8-861a-175845c608ef"
  },
  {
    "id": "41c8ae14-47e3-11e8-98a7-1189ad5b9f47",
    "created_at": "Tue Apr 24 17:17:44 UTC 2018",
    "title": "Sr. Front-End Engineer",
    "location": "San Francisco, CA",
    "type": "Full Time",
    "description": "<p><strong>Company Overview</strong></p>\n\n<p>Abl’s dynamic school scheduling platform makes it easy to design and manage the daily life of your school. Our simple, cloud-based tools work alongside your student information system and eliminate the need for spreadsheets, magnet boards, and stacks of papers.</p>\n\n<p>Our first product is a next-generation Master Scheduler that simplifies and streamlines the entire master scheduling process. Developed in collaboration with secondary schools from around the country, Abl’s Master Scheduler is a smart, flexible platform that enables school leaders to quickly visualize tradeoffs and meet the unique needs of every student and teacher.</p>\n\n<p>We are seeking a Front-End Software Engineer to join our team and help build products that support our mission. We are growing quickly and there is a lot to do! Your contributions will have a meaningful impact on our company.</p>\n\n<p><strong>Qualifications</strong></p>\n\n<ul>\n<li>Experience with Javascript frameworks such as React, Backbone, Angular etc.</li>\n<li>You should have a great feel for user experience and an eye for beautiful designs</li>\n<li>Bring a deep understanding of best practices in design, optimization, interaction, and usability</li>\n<li>Continual learning of emerging technologies/industry trends</li>\n<li>Familiarity with the whole web stack, including protocols and web server optimization techniques</li>\n</ul><p><strong>Your Impact</strong></p>\n\n<ul>\n<li>Work collaboratively with the Product and Design team to understand the experiences and pain points of schools, teachers, and students</li>\n<li>Define and build compelling new products and exciting new features that give educators insights that will enable them to optimize how they use their resources</li>\n<li>Use your extensive knowledge of front-end technologies to build high-quality designs that are scalable</li>\n<li>Manage code review, increase performance, and communicate best front-end engineering practices</li>\n<li>Create a first of its kind interface that will progress K-12 schools and their communities</li>\n</ul><p><strong>Company Culture</strong></p>\n\n<p>Abl employees all share a passion for revolutionizing education through school design, whether or not they have prior experience working in the field. We value diversity of background and thought. We strive to create a safe and supportive environment where trust, communication, creativity, and humility are valued as highly as technical skills. We believe shared ownership builds a more resilient company, and we tackle hard problems, together. If that sounds like your dream work environment, we look forward to hearing from you.</p>",
    "how_to_apply": "<p><a href=\"https://grnh.se/bxyfknf11\">https://grnh.se/bxyfknf11</a></p>",
    "company": "Abl Schools",
    "company_url": "http://www.ablschools.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/3a474566-47e2-11e8-9fa7-16c22f1f89d6.png",
    "url": "http://jobs.github.com/positions/41c8ae14-47e3-11e8-98a7-1189ad5b9f47"
  },
  {
    "id": "ca37951c-2dfd-11e8-93dc-7ec30e6bc6df",
    "created_at": "Mon Apr 23 23:45:19 UTC 2018",
    "title": "Distributed Systems Engineer",
    "location": "Oakland",
    "type": "Full Time",
    "description": "<p><strong>Currently unable to provide relocation assistance and assistance with any type of work visas at the moment</strong></p>\n\n<p>We're looking for a distributed systems engineer to help us build, scale, and maintain LaunchDarkly's real-time data analytics pipeline. You'll be building systems that handle the scale and exponential growth of our product, ingesting, analyzing, and querying billions of events per day.</p>\n\n<p>LaunchDarkly is a rapidly growing software company with a strong mission and vision carried out by a talented and diverse team of employees. Our goal is to help teams build better software, faster. You'll join a small team from companies like Atlassian, Intercom, and Twitter, and you'll have an immediate impact with our product and customers.</p>\n\n<p><strong>Responsibilities</strong></p>\n\n<ul>\n<li>Help build and maintain our distributed, high-throughput, real-time data analytics pipeline, implemented as a set of Go microservices</li>\n<li>Use open-source tools like ElasticSearch, Kafka, Redis, and Cassandra</li>\n<li>Improve the reliability and efficiency of fault-tolerant distributed systems</li>\n<li>Work directly with our CTO and development team to define and evolve our architecture </li>\n</ul><p><strong>Requirements</strong></p>\n\n<ul>\n<li>4+ experience building and maintaining large-scale production systems</li>\n<li>Experience with real-time event logging, stats collection, and analysis</li>\n<li>Strong understanding of networking technologies, plus practical experience dealing with networking issues in real-world environments</li>\n<li>Self‐starter and problem solver, willing to solve difficult problems and work independently when necessary</li>\n<li>Strong testing background: experience building unit, integration, load tests, and benchmarks</li>\n</ul><p>LaunchDarkly serves 20 billion feature flags daily to help software teams build better software, faster. LaunchDarkly gives you the power to to separate feature rollout from code deployment, putting power in the hands of the business and freeing up developers. Teams can deliver faster, more personalized software with less risk. Companies use our feature flag management platform to control the whole feature lifecycle from launch to sunsetting and manage feature flags at scale. LaunchDarkly has server‐side, client‐side and mobile SDKs, including .NET, PHP, Python, Node.js, Java, JavaScript, Ruby/Rails, Go, iOS, and Android. LaunchDarkly is headquartered in Oakland.</p>\n\n<p>We are an equal opportunity employer and we strongly believe that the best teams reflect gender and ethnic diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/launchdarkly/f8842ab1-481a-4f6e-862c-1098aba5a113\">https://jobs.lever.co/launchdarkly/f8842ab1-481a-4f6e-862c-1098aba5a113</a></p>",
    "company": "LaunchDarkly",
    "company_url": "http://LaunchDarkly",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a92cf998-2dfd-11e8-8d21-f0ce4bd7e308.png",
    "url": "http://jobs.github.com/positions/ca37951c-2dfd-11e8-93dc-7ec30e6bc6df"
  },
  {
    "id": "35907810-440b-11e8-8533-2982c8e907ac",
    "created_at": "Thu Apr 19 19:53:03 UTC 2018",
    "title": "Sr. Software Developer (Full Stack) for Consulting Company",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<p><strong>Who are You?</strong></p>\n\n<p>You are a rockstar full stack Software Developer that is current in new technologies AND loves working directly with the clients to architect their solutions. You have awesome oral and written communication skills, a consulting mindset, and are excited to work with multiple clients to design and develop their solutions. You are a go-to person for the team to ask questions and have a collaborative approach to your work.</p>\n\n<p><strong>Who is Echo?</strong></p>\n\n<p>Echo Technology Solutions (ECHO TS) is a premier technology consulting company, partnering with the most prestigious clients in the Bay Area and beyond; primary clientele are venture capital firms, private equity firms, and nonprofits. We take pride in providing high quality holistic services to our clients. We offer Salesforce development, custom software development (full stack), IT support (hardware &amp; software), system and server maintenance, and procurement services. We act as a strategic advisor to our clients, helping them select the appropriate solutions for their missions. See more at <a href=\"http://www.echots.com\">www.echots.com</a>. </p>\n\n<p><strong>What is the Job?</strong></p>\n\n<p>A Senior Software Developer on our team works with 4-8 clients to support and implement business software using a variety of modern services and frameworks. There are two main types of development work – creating and implementing something new and optimizing an existing solution. Our Senior Software Developers are comfortable and happy participating in the full requirements gathering to implementation, testing, and deployment. </p>\n\n<p>A bit more specifically, a Senior Software Developer:</p>\n\n<ul>\n<li>Designs and implements programming solutions in C#/.NET and/or Salesforce without oversight</li>\n<li>Leads a multi-national Scrum team, assuming the role of Product Owner on multiple projects</li>\n<li>Uses Jira to organize, delegate, and communicate internally and with clients</li>\n<li>Is an escalation point for the team, assisting others when they encounter blockers</li>\n<li>Provides thought leadership to the Software Development team</li>\n<li>Independently manages his/her time and tasks</li>\n</ul><p><strong>What’s Work Breakdown?</strong></p>\n\n<p>50% Product Owner Non-Technical tasks: </p>\n\n<ul>\n<li>Client Facing Work: Working with clients to clarify requirements, help with testing, vision and architect the future of the solution, understand the client's business operations, strategy, and vision</li>\n<li>Team Facing Work: Collaborating with the ECHO project team to share requirements, feedback, etc. via meetings, JIRA, chat</li>\n<li>Technical Leadership: Continue to stay at the forefront of technology, to learn new technologies and new features of existing technologies and then to share this with Echo’s Development Team so that our overall team continues to learn and our solutions for clients continue to be top-notch</li>\n</ul><p><strong>50% Product Owner Development tasks:</strong> </p>\n\n<ul>\n<li>Strategize on the high-level design/architecture of the solution</li>\n<li>Oversee teammates' work, that it fits with the client's needs and solution overall, that work is done to high programming standards, guide the team on development strategy for the client</li>\n<li>Doing the actual programming work</li>\n</ul><p><strong>What Echo is Looking For:</strong></p>\n\n<p>The ideal candidate has minimum seven years’ experience as a Developer.</p>\n\n<p><strong>Technical Requirements:</strong></p>\n\n<ul>\n<li>Has solid experience designing, coding, testing, deploying, and maintaining multi-tiered websites built on Microsoft technologies including MS SQL, C#, ASP.NET MVC, Entity Framework, etc.</li>\n<li>Can manage a SQL Server database from model design to query programming while adhering to best practices</li>\n<li>Fantastic experience with JavaScript, CSS, HTML, XSL, SSRS, SSIS, jQuery, JSON, XML</li>\n<li>Lead solutions architecture, design, development, testing, and deployment</li>\n<li>Has strong experience with cloud platforms such as AWS, GCP, and/or Azure</li>\n</ul><p><strong>Non-technical Requirements:</strong></p>\n\n<ul>\n<li>Has leadership qualities and inspires confidence in the team and clients</li>\n<li>Has strong interpersonal skills and easily alternates between technical and nontechnical language</li>\n<li>Is creative, intellectually curious, solution-oriented, and likes a dynamic work experience</li>\n<li>Takes ownership of his or her work and impact on a project, client satisfaction, and the success of ECHO as a company</li>\n<li>Must be able to work in US without visa sponsorship</li>\n<li>Must be able to commute to SF at least 2-3 x per week to be in office</li>\n</ul><p><strong>What’s in it For You?</strong></p>\n\n<p>The career experience is like no-other. This is because you get to work with different clients, with different needs and different environments, and a myriad of problems to solve! You will be doing the consulting hustle, which means you’ll be a rock star with efficient use of time!</p>\n\n<p>People at Echo ALWAYS say that the best part about Echo is the TEAM. You get to work with a fun, supportive, and collaborative team!</p>\n\n<p>Of course, we offer competitive salary and have all of the benefits you would expect, including Health benefits, PTO, and a 401k plan.</p>\n\n<p>The office is part of the WeWork community so you’ll get to work in a well-designed, lively environment with all of the perks that come along with a newly opened co-working space.</p>\n\n<p>Flexible to work remote and in office. Candidates must be in the Bay Area and able to travel to SF office at least 2 x per week. Unfortunately Echo is not able to sponsor any Visas so all applicants must be able to work in US without sponsorship. </p>\n\n<p>Compensation: up to $160k DOE</p>",
    "how_to_apply": "<p><a href=\"https://echots.bamboohr.com/jobs/view.php?id=13\">https://echots.bamboohr.com/jobs/view.php?id=13</a></p>",
    "company": "ECHO Technology Solutions",
    "company_url": "http://www.echots.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/2d5ec85e-440b-11e8-8a89-0e0f654b8406.jpg",
    "url": "http://jobs.github.com/positions/35907810-440b-11e8-8533-2982c8e907ac"
  },
  {
    "id": "4b8a1ca0-43f4-11e8-95a3-b3d04b6189b7",
    "created_at": "Thu Apr 19 17:08:35 UTC 2018",
    "title": "Software Engineer, Foundation Services",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Do you like the idea of running global services that are used by millions of passionate people all over the world? Do you enjoy working on challenges that no one has solved yet? Do you like changing the game? Imagine what you could do here! At Apple, great ideas have a way of becoming great products very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>5+ years of experience of developing and maintaining infrastructure in a high volume of customer-facing environment</li>\n<li>Strong core Java and Java EE programming skills</li>\n<li>Strong object oriented programming and design skills</li>\n<li>Experience with Java web frameworks such as Spring MVC</li>\n<li>Experience writing Java libraries and developing REST APIs (i.e. writing code/services meant to be used by others)</li>\n<li>Experience with writing hand-crafted SQL, PL/SQL</li>\n<li>Familiarity with Tomcat, Weblogic, JBoss, Jetty etc.</li>\n<li>Excellent problem solving skills</li>\n<li>Phenomenal Debugging skills</li>\n<li>Ability to work effectively across multiple business and technical teams</li>\n<li>Demonstrated ability to deliver results on time with high quality</li>\n<li>Aptitude to independently learn new technologies</li>\n<li>Must be self-directed, analytical and work well in a large cross functional environment</li>\n<li>Strong written and oral communication skills</li>\n</ul><p>Description:\nWe are looking to hire outstanding individuals to join our team of Foundation Services to build and run the platform that delivers Apple’s services to all of its customers around the world. Help us build the Apple experience on a global scale.</p>\n\n<p>Responsibilities will include:\nMeasurement and optimization of system performance\nBuild automation frameworks/scripts\nDeployment, support and monitoring of new platforms and application stacks. Participate in new technology evaluation, design and development of highly scalable distributed databases\nExplore and evaluate new technologies and solutions to push our capabilities forward, getting ahead of our customers’ needs, getting people incentivized to transform, innovate and continually improve</p>\n\n<p>Education:\nBS in Computer Science or equivalent experience</p>\n\n<p>Additional Requirements:\nAdditional key skills:\nExperience with SOLR or ElasticSearch\nExperience with Spring-Boot/Dropwizard or similar framework\nKnowledge of HTML5, CSS3, JavaScript and Angular JS\nKnowledge of scripting languages (e.g. ruby, python, Perl, bash, etc.)</p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 113682739\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p><a href=\"https://ars2.equest.com/?response_id=7faf26e87e49c0a975747b8c99dfe55c\">APPLY HERE</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/459d7422-43f4-11e8-9c06-48c95c5f537b.jpeg",
    "url": "http://jobs.github.com/positions/4b8a1ca0-43f4-11e8-95a3-b3d04b6189b7"
  },
  {
    "id": "dd6a279a-4256-11e8-97ec-ae0f0cb03c9b",
    "created_at": "Tue Apr 17 15:49:08 UTC 2018",
    "title": "Sr. iOS Software Engineer",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.</p>\n\n<p>Our technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>8+ years industry experience, including previous experience as a lead</li>\n<li>Superior knowledge of Objective C or Swift</li>\n<li>Solid experience with JavaScript</li>\n<li>Strong object-oriented programming and design skills</li>\n<li>Experience with online or mobile advertising industry desired</li>\n<li>Strong problem solving and debugging skills are required</li>\n<li>Ability to communicate effectively, both written and verbal, with technical and non-technical cross-functional teams</li>\n<li>Result oriented and deadline driven</li>\n</ul><p>Description:<br>\nWe are looking for an Engineer to develop iOS apps for Ad Platforms. You should be a self-motivated individual who can thrive in an Agile environment. You will be creating cutting-edge iOS applications Ad Platforms. We’re looking for detail-oriented, creative engineers to build the world’s best iOS applications.</p>\n\n<p>Education:<br>\nAdvanced degree in Computer Science preferred.</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n\n<p>REQUISITION NUMBER: 113607339\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p><a href=\"https://ars2.equest.com/?response_id=3a752e775f95ba39d154c3ffead0ac78\">APPLY HERE</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/db236410-4256-11e8-939e-688dc78dfb8b.jpeg",
    "url": "http://jobs.github.com/positions/dd6a279a-4256-11e8-97ec-ae0f0cb03c9b"
  },
  {
    "id": "0c9628d2-401a-11e8-98f4-55dcb19bd03b",
    "created_at": "Sat Apr 14 19:29:58 UTC 2018",
    "title": "Full Stack Web Developer",
    "location": "Los Angeles",
    "type": "Full Time",
    "description": "<p>Full Stack Web Developer</p>\n\n<p>Los Angeles, United States</p>\n\n<p>Part Time and/or Full Time - Programmer</p>\n\n<p>What you'll be doing: As a front-end web developer, you'll be working directly with our team of engineers and our CEO to build out the front-end website and mobile phone user interface. You will work with our designer as well to help create the medical content that we require to display on our application. You'll help ensure the UI interface is clean, accessible, easy to learn, and well documented. You will help build amazing demos and APIs from scratch, to create an AR experience unlike anything seen before. You'll be challenged on a daily basis and have the opportunity to shape cutting edge technologies.</p>\n\n<p>Duration: Long Term Contract</p>\n\n<p>Salary: $2-4k per month starting out</p>\n\n<p>Level: Mid/Senior Level</p>\n\n<p>Job Location: Preferably Los Angeles, Remote is also fine. With progressive success, help moving to California may be possible.</p>\n\n<p>Required Expertise:</p>\n\n<pre><code>3+ years experience in Front-End Web programming with portfolio of work to demo;\nAll layers of client-side and server-side software design;\nFluent in HTML, CSS, JavaScript, jQuery, Python;\nProven software designing skills to create extensible/reusable software that meets architectural objectives;\nFront-end(client-side) frameworks such as React.js, Angular.js, bootstrap, backbone, etc;\nServer-side technologies, especially Django in Python\nIntegration with REST Services; and,\nContinuous integration/deployment, performance/function testing.\n</code></pre>\n\n<p>Additional expertise:</p>\n\n<pre><code>Native iOS/Android development experience is a plus.\nCross-platform development in C++.\nExperience using AR/VR devices like HoloLens, Oculus etc.\nKnowledge in Computer Vision and tracking algorithms is a plus.\nExperience in inertial motion sensor and motion capture is a plus.\n</code></pre>\n\n<p>Background Profile requirements: Undergraduate degree not required but preferred in Computer Science, Software Engineering, Game Development, or other relevant fields. Preferred Experience working in high-performance teams and operating effectively on highly dynamic projects and tasks. If no college degree, then more 6 years of experience in medium-large size companies with portfolio examples of work to show.</p>\n\n<p>Professional trait requirements : Excellent problem solving, troubleshooting and debugging skills. Reliably meet deadlines Clear communication skills Experience with version source control, agile software development, and test driven development well-documented, maintainable, and reusable code. Team player capable of working well with others and leveraging other people’s skills and strengths to deliver a stellar product Systematic thinking for quickly prototyping solutions, and to fail fast and learn faster.</p>\n\n<p>Company Background: Extend View is an international startup in the medical virtual reality industry. Extend View was founded in spring 2017. The founder has worked in several startups in the past 5 years, worked overseas in China and has ties to the venture capital scene in the Bay Area. Extend View is currently looking for computer science and software engineers to develop its client application platforms in the virtual reality and/or augmented reality space. We already have initiated partnerships with Stanford University Medical Center in terms of choosing appropriate augmented reality applications and we have engaged with hardware engineering companies as partners/consultants to our software developers. We are looking for computer programmers who have an interest in making a difference in the medical landscape and also experience in developing augmented reality applications, similar to the software programs developed for gaming.</p>\n\n<p>Job Type: Part-time and Full-Time</p>\n\n<p>Job Type: Contract</p>\n\n<p>Salary: $2,000.00 to $4,000.00 /month</p>",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:info@extendview.com\">info@extendview.com</a></p>",
    "company": "Extend View Inc",
    "company_url": "http://www.extendview.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/0c9628d2-401a-11e8-98f4-55dcb19bd03b"
  },
  {
    "id": "39bd6f52-3e79-11e8-9e6f-c240d69db420",
    "created_at": "Thu Apr 12 17:45:51 UTC 2018",
    "title": "Software Developer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<p>TITLE:  Software Developer</p>\n\n<p>TEAM: Image Acquisition Software Team</p>\n\n<p>WORKS WITH:  Acquisitions Lead, Infrastructure, Operations, Analysis</p>\n\n<p>STATUS:  Permanent/Exempt</p>\n\n<p>SCHEDULE:  40hrs/week</p>\n\n<p>DEADLINE:  Review of applications will begin mid April, 2018 and continue until the position is filled.</p>\n\n<p>DIVERSITY: It’s very important to us. We welcome all applicants.</p>\n\n<p>Company Overview:</p>\n\n<p>3Scan is a biotech startup in San Francisco that digitizes whole tissue samples through a technique that combines automation, machine learning and artificial intelligence. Our process was invented to revolutionize histology in support of translational medical research, pharmaceutical development and the biotech industry. </p>\n\n<p>Our novel approach captures high resolution images of complete tissue samples, through serial sectioning and simultaneous high resolution image capture, enabling them to compute metrics and apply mathematical models. This technique empowers scientific discovery by creating a map the related structures of the micro-environment and producing not only detailed 3D representations but providing decision support in the emerging field of computational pathology.</p>\n\n<p>3Scan’s growing team of engineers, biologists and data-scientists is united by intellectual curiosity and the desire to further the progress of biology. The VCs of Silicon Valley call us “hot-pink-haired techno punks,” but we embrace all hair colors. We work hard, and we’re passionate about the potential our technology has to change the future of pathology.</p>\n\n<p>Our labs and offices in the Mission District are in the center of San Francisco’s booming science and tech culture: we hold regular talks on topics ranging from histology to optics to polymer physics. 3Scan holds several patents across a variety of disciplines and has trademarked the term Squishware™.</p>\n\n<p>3Scan’s science is multidisciplinary and results-driven. Our values apply to our work and lives. We encourage our team in their work inside and outside the company, whether they’re publishing articles, building art, or dreaming robots.</p>\n\n<p>Read more about the company on our website <a href=\"http://www.3Scan.com\">www.3Scan.com</a></p>\n\n<p>Role Summary:</p>\n\n<p>As a Software Developer you will be part of the Image Acquisition Software Team and will work with the image acquisition lead. This team is responsible for the care, feeding and enhancement of 12 software-controlled tissue-slicing robots.  Our robotic microscopes have nanometer-precise positioning stages and high speed cameras, with custom electronics and firmware.  They connect to a browser-based control interface, which operators use in the daily generation of terabytes of imaging data. </p>\n\n<p>To succeed here, you’ll need curiosity, humility and an open mind. This is a role that can grow with you.</p>\n\n<p>Relevant Experience:</p>\n\n<p>The ideal candidate will have at least 5 years of related experience. You will need some exposure to hardware startups, industrial controls, scientific imaging or distributed systems. </p>\n\n<p>Basic Qualifications:</p>\n\n<p>HTTP &amp; RPC Services, Hardware device integration , Python 3 or another similar programming language, AWS or another IaaS platform</p>\n\n<p>Bonus Experience:</p>\n\n<p>Experience with industrial or scientific cameras, IoT experience, CNC machine control / industrial automation, Familiarity with a modern JavaScript application framework, Java / Kotlin, Windows system administration</p>\n\n<p>Compensation and Office Culture: \n Flexible Vacation and Work From Home\n Medical, Dental, Vision Benefits\n Gender balanced engineering group\n Maternity/Paternity Leave\n Healthy snacks/drinks and weekly lunch\n Family/Pet friendly office</p>\n\n<p>Thank you in advance for your interest in 3Scan. Due to the volume of applicants, only candidates who will be invited to interview will be contacted.</p>",
    "how_to_apply": "<p>Interested candidates should submit a single PDF attachment that includes both a cover letter and resume. Send this to <a href=\"mailto:AcquisitionDeveloperApplicant@3scan.com\">AcquisitionDeveloperApplicant@3scan.com</a> with subject line: Acquisition Developer Applicant / [your name].</p>",
    "company": "3Scan",
    "company_url": "http://www.3scan.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/f62a1efc-3e78-11e8-823b-105af6702d32.png",
    "url": "http://jobs.github.com/positions/39bd6f52-3e79-11e8-9e6f-c240d69db420"
  }
]
